

<!DOCTYPE html>
<html class="writer-html5" lang="en" data-content_root="../../">
<head>
  <meta charset="utf-8" /><meta name="viewport" content="width=device-width, initial-scale=1" />

  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
  <title>Optimization Tools &mdash; Zephyr Project Documentation</title>
      <link rel="stylesheet" type="text/css" href="../../_static/pygments.css?v=03e43079" />
      <link rel="stylesheet" type="text/css" href="../../_static/css/theme.css?v=9edc463e" />
      <link rel="stylesheet" type="text/css" href="../../_static/graphviz.css?v=4ae1632d" />
      <link rel="stylesheet" type="text/css" href="../../_static/doxytooltip.css?v=07852572" />
      <link rel="stylesheet" type="text/css" href="../../_static/copybutton.css?v=76b2166b" />
      <link rel="stylesheet" type="text/css" href="../../_static/togglebutton.css?v=9c3e77be" />
      <link rel="stylesheet" type="text/css" href="../../_static/css/custom.css?v=b2ece5be" />

  
    <link rel="shortcut icon" href="../../_static/favicon.png"/>
    <link rel="canonical" href="https://docs.zephyrproject.org/latest/develop/optimizations/tools.html" />
      <script src="../../_static/jquery.js?v=5d32c60e"></script>
      <script src="../../_static/_sphinx_javascript_frameworks_compat.js?v=2cd50e6c"></script>
      <script src="../../_static/documentation_options.js?v=2f20d6c1"></script>
      <script src="../../_static/doctools.js?v=fd6eb6e6"></script>

<section id="data-structures">
<span id="data-structure-tools"></span><h2>Data Structures<a class="headerlink" href="#data-structures" title="Link to this heading"></a></h2>
<section id="build-target-pahole">
<h3>Build Target: pahole<a class="headerlink" href="#build-target-pahole" title="Link to this heading"></a></h3>
<p>Poke-a-hole (pahole) is an object-file analysis tool to find the size of
the data structures, and the holes caused due to aligning the data
elements to the word-size of the CPU by the compiler.</p>
<p>Poke-a-hole (pahole) must be installed prior to using this target. It can be
obtained from <a class="reference external" href="https://git.kernel.org/pub/scm/devel/pahole/pahole.git">https://git.kernel.org/pub/scm/devel/pahole/pahole.git</a> and is
available in the dwarves package in both fedora and ubuntu:</p>
<div class="highlight-none notranslate"><div class="highlight"><pre><span></span>sudo apt-get install dwarves
</pre></div>
</div>
<p>Alternatively, you can get it from fedora:</p>
<div class="highlight-none notranslate"><div class="highlight"><pre><span></span>sudo dnf install dwarves
</pre></div>
</div>
<p>After you installed the package, use <code class="docutils literal notranslate"><span class="pre">pahole</span></code> target with your board,
as in the following example.
If you are using <a class="reference internal" href="../../build/sysbuild/index.html#sysbuild"><span class="std std-ref">Sysbuild (System build)</span></a>, see <a class="reference internal" href="../../build/sysbuild/index.html#sysbuild-dedicated-image-build-targets"><span class="std std-ref">Dedicated image build targets</span></a> instead.</p>
<p>Using west:</p>
<div class="highlight-shell notranslate"><div class="highlight"><pre><span></span><span class="c1"># From the root of the zephyr repository</span>
west<span class="w"> </span>build<span class="w"> </span>-b<span class="w"> </span>reel_board<span class="w"> </span>samples/hello_world
west<span class="w"> </span>build<span class="w"> </span>-t<span class="w"> </span>pahole
</pre></div>
</div>
<p>Using CMake and ninja:</p>
<div class="highlight-shell notranslate"><div class="highlight"><pre><span></span><span class="c1"># From the root of the zephyr repository</span>
<span class="c1"># Use cmake to configure a Ninja-based buildsystem:</span>
cmake<span class="w"> </span>-Bbuild<span class="w"> </span>-GNinja<span class="w"> </span>-DBOARD<span class="o">=</span>reel_board<span class="w"> </span>samples/hello_world

<span class="c1"># Now run the build tool on the generated build system:</span>
ninja<span class="w"> </span>-Cbuild<span class="w"> </span>pahole
</pre></div>
</div>
<p>Pahole will generate something similar to the output below in the console:</p>
<div class="highlight-none notranslate"><div class="highlight"><pre><span></span>/* Used at: [...]/build/zephyr/kobject_hash.c */
/* &lt;375&gt; [...]/zephyr/include/zephyr/sys/dlist.h:37 */
union {
        struct _dnode *            head;               /*     0     4 */
        struct _dnode *            next;               /*     0     4 */
};
/* Used at: [...]/build/zephyr/kobject_hash.c */
/* &lt;397&gt; [...]/zephyr/include/zephyr/sys/dlist.h:36 */
struct _dnode {
        union {
                struct _dnode *    head;                 /*     0     4 */
                struct _dnode *    next;                 /*     0     4 */
        };                                               /*     0     4 */
        union {
                struct _dnode *    tail;                 /*     4     4 */
                struct _dnode *    prev;                 /*     4     4 */
        };                                               /*     4     4 */

        /* size: 8, cachelines: 1, members: 2 */
        /* last cacheline: 8 bytes */
};
/* Used at: [...]/build/zephyr/kobject_hash.c */
/* &lt;3b7&gt; [...]/zephyr/include/zephyr/sys/dlist.h:41 */
union {
        struct _dnode *            tail;               /*     0     4 */
        struct _dnode *            prev;               /*     0     4 */
};
...
...
</pre></div>
</div>
</section>
</section>
<section id="dashboard">
<span id="id2"></span><h2>Dashboard<a class="headerlink" href="#dashboard" title="Link to this heading"></a></h2>
<p>An HTML dashboard can be generated that consolidates the various tool
outputs and artifacts into one simple view. In addition to a basic summary of
the build results, the following details are included:</p>
<ul class="simple">
<li><p>Full memory reports (ram, rom) in drill-down table form as well as
<a class="reference internal" href="#footprint-tools-plot"><span class="std std-ref">plots</span></a> (as per the <code class="docutils literal notranslate"><span class="pre">footprint</span></code>, <code class="docutils literal notranslate"><span class="pre">ram_plot</span></code>,
and <code class="docutils literal notranslate"><span class="pre">rom_plot</span></code> build targets).</p></li>
